---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsPipeSegmentParam
source: html/e975de8f-f7e4-6353-0aac-b0be7874f8b4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsPipeSegmentParam Property

"Pipe Segment"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsPipeSegmentParam { get; }
```